hyderhusainarastu/byok-mod/firmware/s3/sdkconfig.defaults
# ------------------------------------------------------------------------------
# FreeRTOS stack-overflow detection: CANARY method (writes and checks a
# sentinel word past the end of each task's stack on every context switch --
# this is exactly what caught the 2026-09-03 incident and produced its
# "A stack overflow in task main has been detected" message). Already IDF's
# own default and therefore already in effect even before this line existed
# (see firmware/s3/sdkconfig, which mirrors whatever the toolchain's default
# choice is) -- pinned explicitly here, per this file's own top-of-file rule
# ("change this file... so a clean checkout reproduces the same build"),
# specifically so a future IDF upgrade changing its own default can't
# silently turn this off. Never weaken to PTRVAL or NONE.
# ------------------------------------------------------------------------------
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# ------------------------------------------------------------------------------
# 0.1.7 (docs/display.md Sec.6 -- re-derived the command(0x38)/data(0x39)
# I2C address polarity from the vendor disassembly AND the real UltraChip
# UC1611 datasheet; found NO inversion, CONFIRMED the existing mapping):
# components/byok_display/Kconfig's new BYOK_DISPLAY_POLARITY_EXPERIMENT
# defaults to `y` in the component Kconfig itself, so no override line is
# needed here -- this comment exists only so the option's presence in this
# release is visible from this file without having to open the component
# Kconfig. ON (this build): byok_display_run_boot_selftest() is REPLACED by
# byok_display_run_polarity_experiment() -- see that Kconfig entry's help
# text for the three-pass (A/B/C) design. `CONFIG_BYOK_DISPLAY_TRUE_SYSTEM_
# RESET=n` and `CONFIG_BYOK_DISPLAY_BULK_WRITES=n` above are UNCHANGED by
# this release (still explicit overrides from 0.1.6/0.1.5 respectively) --
# the polarity experiment's own reinit passes go through the same
# lcd_hw_reset_and_init()/flush_rect() paths those options already gate, so
# both settings apply identically across all three passes.
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# 0.1.8 (instruction-level reversal of the vendor's sim_send()/sim_reset() --
# the functions this project's "I2C GPIO expander" hypothesis was about;
# published in docs/display.md Sec.6): REFUTED. The vendor's own transport is exactly one 1-byte
# i2c_master_transmit() per LCD byte to 0x38 (command) / 0x39 (data), no
# strobe, no control byte, no delay, no read path -- already byte-for-byte
# and transaction-for-transaction what this driver's lcd_send() does. No
# transport code changed this release. `CONFIG_BYOK_DISPLAY_POLARITY_
# EXPERIMENT`'s component-Kconfig default flips back to `n` (that option's
# own updated help text explains why); no override line is needed here for
# that, same as no override was needed for `y` in 0.1.7 -- both defaults
# come from the component Kconfig alone. The one substantive change is
# code, not config: byok_display_init()/byok_display_full_refresh(true) now
# also send the vendor's CMD 0xC9 / DATA 0xAD display-enable pair once,
# immediately after the first full frame reaches display RAM
# (hw_config.h Sec.3.2.1) -- the one gdisp_init() step byok-mod omitted
# through 0.1.7.
# ------------------------------------------------------------------------------
